/* Key Class Names. */

/* The key is the numeric value as defined in cssmtype.h in Apple's Security framework.  Last updated for 10.4.10. */
/* The value is human-readable name for the key class. */

0 = "Public key";
1 = "Private key";
2 = "Session key";
3 = "Secret part";
4294967295 = "Other";